-- phpMyAdmin SQL Dump
-- version 4.5.4.1deb2ubuntu2.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Sep 24, 2021 at 11:42 AM
-- Server version: 5.7.33-0ubuntu0.16.04.1
-- PHP Version: 7.0.33-0ubuntu0.16.04.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` int(11) NOT NULL,
  `quest_range` int(11) NOT NULL,
  `quest` text NOT NULL,
  `ans_true` varchar(50) NOT NULL,
  `false_1` varchar(50) NOT NULL,
  `false_2` varchar(50) NOT NULL,
  `false_3` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `quest_range`, `quest`, `ans_true`, `false_1`, `false_2`, `false_3`) VALUES
(1, 1, 'Ո՞ր կրոնական փիլիսոփայության ուղղություններից է Դզեն ուսմունքը.', 'Բուդդիզմ', 'Դաոսիզմ', 'Հինդուիզմ', 'Հուդաիզմ'),
(2, 2, '1932թ. ո՞ր քաղաքում է առաջին անգամ անցկացվել առաջին միջազգային կինոփառատոնը.', 'Վենետիկ', 'ԲԵռլին', 'Մոսկվա', 'Կանն'),
(3, 3, 'Ո՞ր քիմիական տարրն է անվանվել ի պատիվ ստորգետնյա չար թզուկի.', 'Կոբալտ', 'Հաֆնիում', 'Տելուր', 'Բեռլինում'),
(4, 1, 'Քանի՞ ծով է ողողում Բալկանյան թերակղզին.', '6', '4', '5', '3'),
(5, 2, 'Ռուսաստանի քարտեզի վրա ինչպիսի՞ անվանումով գետ գոյություն չունի.', 'Մեջք', 'Բերան', 'Մատ', 'Պարանոց'),
(6, 3, 'Հին Հունաստանի բնակչուհին Օլիմպիական խաղերի ո՞ր կարգում կարող էր հաղթել.', 'Կառքերի մրցավազք', 'Լող', 'Վազք', 'Ըմբշամարտ'),
(7, 1, 'Բացի թվային ինդեքսից, ինչպիսի՞ անվանում ունի Android օպերացիոն համակարգի յուրաքանչյուր տարբերակը.', '<Քաղցր>', '<Հնդկացիական>', '<Ծովային>', '<Գարնանային>'),
(8, 1, 'Ո՞ր կղզին է անվանվել ի պատիվ հայտնի հոլանդացի ծովագնացի.', 'Թասմանիա', 'Մադագասկար', 'Սումատրա', 'Կալիմանթան'),
(9, 1, 'Ո՞ր հասկացությունն են բառարանները բնորոշում որպես «Արևի կենտրոնի ստորին գագաթնակետի պահ».', 'Կեսգիշեր', 'Մագնիսական փոթորիկ', 'Արևի խավարում', 'Ամառ'),
(10, 1, 'Որտեղի՞ց է գալիս ֆուժեր անվանումը.', 'Քաղաք', 'Բույս', 'Հախճապակու տեսակ', 'Ապակեգործի ազգանուն'),
(11, 1, 'Ինչպե՞ս են կոչվում իշամեղուները, որոնք բույն չեն կառուցում և նեկտար չեն հավաքում.', 'Կկու իշամեղուներ', 'Ծույլ իշամեղուներ', 'Բզզան իշամեղուներ', 'Մակաբույծ իշամողուներ'),
(13, 2, 'Which of these US presidents appeared on the television series "Laugh-In?"', 'Richard Nixon', 'Lyndon Johnson', 'Jimmy Carter', 'Gerald Ford'),
(14, 2, 'The Earth is approximately how many miles away from the Sun?', '93 million', '9.3 million', '39 million', '193 million'),
(15, 2, 'Which insect shorted out an early supercomputer and inspired the term "computer bug"?', 'Moth', 'Roach', 'Fly', 'Japanese beetle'),
(16, 2, 'Which of the following men does not have a chemical element named for him?', 'Isaac Newton', 'Albert Einstein', 'Niels Bohr', 'Enrico Fermi'),
(17, 3, 'Which of the following landlocked countries is entirely contained within another country?', ' Lesotho', 'Burkina Faso', 'Mongolia', 'Luxembourg'),
(18, 3, 'In the children’s book series, where is Paddington Bear originally from?', 'Peru', 'India', 'Canada ', 'Iceland'),
(19, 3, 'Who is credited with inventing the first mass-produced helicopter?', 'Igor Sikorsky', 'Elmer Sperry', 'Ferdinand von Zeppelin', 'Gottlieb Daimler'),
(20, 3, 'What letter must appear on the beginning of the registration number of all non-military aircraft in the US?', 'N', 'A', 'U', 'L'),
(21, 1, 'Ո՞ր երկրում է սկիզբ առել ֆաշիզմը', 'Իտալիա', 'Ճապոնիա', 'Գերմանիա', 'Ավստրո-Հունգարիա'),
(22, 1, 'Մարդու օրգանիզմում որտե՞ղ է առաջանում արյունը', 'Ոսկոր', 'Լյարդ', 'Փայծաղ', 'Ողնուղեղ'),
(23, 1, 'Ինչպե՞ս է իրեն պահում արու պինգվինը, երբ «առաջարկություն է անում» էգ պինգվինին', 'Քար է նվիրում', 'Ուղղակի տիրում է և վերջ', 'Հոգ է տանում մի քանի օր', 'Ձուկ է հյուրասիրում'),
(24, 1, 'Այս երկրներից որո՞ւմ է աջակողմյան երթևեկություն', 'Շվեդիա', 'Ուելս', 'Հյուսիսային Իռլանդիա', 'Ճապոնիա'),
(25, 1, 'Ո՞ր սպորտաձևն է ամենապոպուլյարը Լատվիայում', 'Հոկեյ', 'Բասկետբոլ', 'Թեթև ատլետիկա', 'Ֆուտբոլ'),
(26, 1, 'Նշված երկրներից ո՞ր երկիրը չի մասնակցել ոչ առաջին և ոչ էլ երկրորդ համաշխարհային պատերազմներին', 'Շվեյցարիա', 'Ռումինիա', 'Պորտուգալիա', 'Կանադա'),
(27, 1, 'Ի պատիվ ո՞ւմ է անվանվել Mozilla Firefox դիտարկիչը', 'Պանդա', 'Աղվես', 'Գայլ', 'Առյուծ'),
(28, 1, 'Ի՞նչ է իրենից ներկայացնում գնահատման սանդղակը Դանիայում', '7 բալային համակարգ', '4 բալային համակարգ', '13 բալային համակարգ', '10 բալային համակարգ'),
(29, 1, 'Որտե՞ղ են հորինվել արաբական թվերը', 'Հնդկաստան', 'Պարսկաստան', 'Հին Չինաստան', 'Եգիպտոս'),
(30, 2, 'Կոմպոզիտոր Ա․ Վիվալդիի մականունը «Կարմիր հոգևորական էր»: Նա իրոք հոգևորական էր: Բայց ինչո՞ւ «Կարմիր»', 'Նա կարմրահեր էր', 'Կարմիր վարդեր էր աճեցնում', 'Սիում էր կարմիր գույնը', 'Նրա սենյակի պատերը ներկված էին կարմիր'),
(31, 2, 'Ի՞նչ նկատի ուներ միջին դարերի անգլիացի գրող Ալկուին Յորսկին գրելով․ «Դա գիշեր է ցերեկվա ընթացքում և ծանրություն աչքերի համար»', 'Լոնդոնյան մառախուղ', 'Ցերեկվա քուն', 'Փոթորիկ', 'Ընթերցանություն'),
(32, 2, 'Քանի ամբողջական շաբաթ կա մեկ օրացույցային տարվա մեջ', '52', '74', '63', '47'),
(33, 2, 'Այս կետերից ո՞րն է ամենախոշորը', 'Կապույտ', 'Ճապոնական', 'Սապատավոր', 'Գրելանդական'),
(34, 2, 'Ո՞ր թռչունն է համարվում Նոր Զելանդիայի խորհրդանիշը', 'Կիվի', 'Ջայլամ', 'Սիրամարգ', 'Կակադու'),
(35, 2, 'Ո՞ր երկրում է գտնվում Սանտիագո քաղաքը', 'Չիլի', 'Արգենտինա', 'Իսպանիա', 'Պերու'),
(36, 2, 'Ո՞վ է պատկերված մեկ դոլարանոց թղթադրամի վրա', 'Ջորջ Վաշինգտոն', 'Բենջամին Ֆրանկլին', 'Ավրահամ Լինքոլն', 'Թոմաս Ջեֆերսոն'),
(37, 2, 'Այս Մայրցամաքներից մեկով հոսում է Ամազոնը', 'Հարավային Ամերիկա', 'Աֆրիկա', 'Հյուսիսային Ամերիկա', 'Ավստրալիա'),
(38, 2, 'Ո՞ր գիտնականին նկատի ունեն ասելով․ «Մարդ, ով հորինեց XX-րդ դարը»', 'Նիկոլա Տեսլա', 'Լև Լանդաու', 'Իսահակ Նյուտոն', 'Ալբերտ Էյնշտեյն'),
(39, 2, 'Ինչի՞ց է վախենում վերմինոֆոբիայով տառապող մարդը', 'Մանրեներից', 'Արագությունից', 'Խորությունից', 'Վառ լույսից'),
(40, 2, 'Ո՞ր թվականին է տեղի ունեցել Վեզուվիի ժայթքումը, որը կործանեց Պոմպեյ քաղաքը', '79թ․', '355թ․', '585թ․', '79թ․'),
(41, 2, 'Նշված վայրերից ո՞րը պետք է այցելեք, եթե ցանկանում եք տեսնել Ռաֆայելի վրձնին պատկանող Սեքստինյան Տիրամոր նկարը․', 'Հին վարպետների պատկերասրահ,Դրեզդեն', 'Լուվր, Փարիզ', 'Պրադոյի ազգային թանգարան, Մադրիդ', 'Ազգային պատկերասրահ, Լոնդոն'),
(42, 3, 'Որքա՞ն է Երկիր մոլորակի բնակչության մոտավոր թիվը', 'Մոտ 7.7 մլրդ', 'Մոտ 4.2 մլրդ', 'Մոտ 10 մլրդ', 'Մոտ 5.5 մլրդ'),
(43, 3, 'Քաղաքական գործիչներից ո՞վ է Նոբելյան մրցանակ ստացել գրականության ասպարեզում․', 'Ուինսթոն Չերչիլ', 'Միխաիլ Գորբաչով', 'Ինդիրա Գանդի', 'Մարգարետ Թետչեր'),
(44, 3, 'Համաձայն Կոնֆուցիոսի, ինչո՞վ է պետք պատասխանել չարին', 'Արդարությամբ', 'Չարով', 'Բարությամբ', 'Անտարբերությամբ'),
(45, 3, 'Ինչպե՞ս է կոչվում տիեզերանավը, որն առաջինն է վայրէջք կատարել Լուսնի վրա', '«Ապոլոն 11»', '«Օրիոն 5»', '«Ջեմինի 1»', '«Սփեյս 3»'),
(46, 3, 'Թվարկված ծովերից որի՞ ջրերով է ողողվում Գվատեմալայի հանրապետությունը', 'Կարիբյան', 'Կորալյան', 'Միջերկրական', 'Կարմիր'),
(47, 1, 'Ինչպե՞ս էր Ժյուլն Վերնի «80 օր աշխարհի շուրջ» վեպի գլխավոր հերոսի անունը․', 'Ֆիլեաս Ֆոգ', 'Ռետ Բաթլեր', 'Հոլդեն Քոլֆիլդ', 'Ֆիցուիլյամ Դարսի'),
(48, 3, 'Ինչպե՞ս է այսօր կոչվում այն պետությունը, որն երկար տարիներ կոչվել է Բիրմա', 'Մյանմա', 'Թայլանդ', 'Բենին', 'Շրի Լանկա'),
(49, 3, 'Ո՞ր կենդանին է Երկիր մոլորակում համարվում ամենաբարձրաձայնը', 'Կապույտ կետ', 'Գորիլա', 'Առյուծ', 'Փիղ'),
(50, 3, 'Ո՞ր ծովն է համարվում ամենափոքրը մեր մոլորակում', 'Մարմարա', 'Ազովի', 'Բարենցի', 'Էգեյան'),
(51, 3, 'Ճապոնիայում քանի՞ հրաբուխ է համարվում ակտիվ', '111', '158', '48', '91'),
(52, 1, 'Այս քաղաքներից ո՞րը ՉԻ գտնվում Իտալիայում․', 'Վալենսիա', 'Թուրին', 'Վերոնա', 'Ֆլորենցիա'),
(53, 3, 'Ո՞ր հասցեով էր բնակվում հանրահայտ խուզարկու Շերլոկ Հոլմսը', 'Բեյքեր Սթրիթ, 221b', 'Բոնդ Սթրիթ, 221b', 'Դաունինգ Սթրիթ, 221b', 'Քարնաբի Սթրիթ, 221b'),
(54, 2, 'Ո՞ր երկիրն է նախկինում կոչվել «Նոր Հոլանդիա»', 'Ավստրալիա', 'Ներ Զելանդիա', 'Արգենտինա', 'Ինդոնեզիա'),
(55, 1, 'Ո՞ր սպարտաձևում է հաջողություններ գրանցել Ռաֆայել Նադալը', 'Թենիս', 'Ֆուտբոլ', 'Գեղասահք', 'Լող'),
(56, 2, 'Ինչպե՞ս էին հին Հունաստանում անվանում գիտության մուսային', 'Ուրանիա', 'Կալիոպա', 'Էտերպե', 'Տերպսիքոր'),
(57, 2, 'Ումի՞ց կամ ինչի՞ց է վախենում անտրոպոֆոբը', 'Մարդկանցից', 'Կմախքներից', 'Արյան տեսքից', 'Մարդակերներից'),
(58, 3, 'Արեգակնային համակարգում Երկիր մոլորակի հարևաններն են', 'Վեներա, Մարս', 'Մերկուրի, Մարս', 'Սատուրն, Վեներա', 'Սատուրն, Մարս'),
(59, 2, 'Ո՞վ է գրել «Աստվածային կատակերգությունը»', 'Դանթե Ալիգիերի', 'Գյոթե', 'Հոմերոս', 'Ալեքսանդր Պուշկին'),
(60, 2, 'Աշխարհի 7 հրաշալիքներից չէ', 'Թաջ Մահալը', 'Զևսի արձանը', 'Քեոփսի բուրգը', 'Շամիրամի կախովի այգիները');

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `user_first` varchar(255) NOT NULL,
  `user_last` varchar(255) NOT NULL,
  `user_email` varchar(255) NOT NULL,
  `user_uid` varchar(255) NOT NULL,
  `user_pwd` varchar(255) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id`, `user_first`, `user_last`, `user_email`, `user_uid`, `user_pwd`, `img`) VALUES
(1, 'g', 'g', 'g@mail.ru', 'g', '$2y$10$7gvURqbk7kfwxhefSa1OgOjPCjOUHma8TZowREHzwAqNcHwueZ1t.', 'g');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;
--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
